package mindmap.view.menu;

import javax.swing.*;

public class RemindMenuTemplate {
	
	/**-----------------------------------------------------------------------------------------
	-----------------------------------------------------------------------------------메뉴 생성 틀*/
	
	public JMenu addMenu(String title) 			{ return new JMenu(title); }
	
	/**-----------------------------------------------------------------------------------------
	-------------------------------------------------------------------------------메뉴 아이템 생성 틀*/
	
	public JMenuItem addMenuItem(String title) 	{ return new JMenuItem(title); }
	
	/**-----------------------------------------------------------------------------------------
	---------------------------------------------------------------------------------공백 줄 생성 틀 */
	
	public JSeparator addSeparator() 			{ return new JSeparator(); }
}